# YOLOv5 🚀 by YOLOAir, GPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]], # 2
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]], # 4
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]], # 6
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3, [1024]], # 8
    [-1, 1, SPPF, [1024, 5]], # 9 SPPF
    [-1, 1, CBAM, [1024]], # 10 CBAM
  ]
# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [512, 1, 1]], # 11
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 12
    [[-1, 6], 1, Concat, [1]], # 13 - cat backbone P4
    [-1, 1, CBAM, [1024]], # 14 CBAM
    [-1, 3, C3, [512, False]], # 15

    [-1, 1, Conv, [256, 1, 1]], # 16
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 17
    [[-1, 4], 1, Concat, [1]], # 18 - cat backbone P3
    [-1, 1, CBAM, [512]], # 19 CBAM
    [-1, 3, C3, [256, False]], # 20 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]], # 21
    [[-1, 15], 1, Concat, [1]], # 22 - cat head P4
    [-1, 1, CBAM, [512]], # 23 CBAM
    [-1, 3, C3, [512, False]], # 24 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]], # 25
    [[-1, 11], 1, Concat, [1]], # 26 - cat head P5
    [-1, 1, CBAM, [1024]], # 27 CBAM
    [-1, 3, C3, [1024, False]], # 28 (P5/32-large)

    [[20, 24, 28], 1, Detect, [nc, anchors]], # 29 - Detect(P3, P4, P5)
  ]
